Revit 2026 API
AdaptiveComponentInstanceUtils Class
 An interface for Adaptive Component Instances.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AdaptiveComponentInstanceUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public static class AdaptiveComponentInstanceUtils
Public NotInheritable Class AdaptiveComponentInstanceUtils
public ref class AdaptiveComponentInstanceUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type AdaptiveComponentInstanceUtils = class end
The AdaptiveComponentInstanceUtils type exposes the following members.
Methods
Name | Description
CreateAdaptiveComponentInstance |  Creates a FamilyInstance of Adaptive Component Family.
GetInstancePlacementPointElementRefIds |  Gets Placement Adaptive Point Element Ref ids to which the instance geometry adapts.
GetInstancePointElementRefIds |  Gets Adaptive Point Element Ref ids to which the instance geometry adapts.
GetInstanceShapeHandlePointElementRefIds |  Gets Shape Handle Adaptive Point Element Ref ids to which the instance geometry adapts.
HasAdaptiveFamilySymbol |  Verifies if a FamilyInstance has an Adaptive Family Symbol.
IsAdaptiveComponentInstance |  Verifies if a FamilyInstance is an Adaptive Component Instance.
IsAdaptiveFamilySymbol |  Verifies if a FamilySymbol is a valid Adaptive Family Symbol.
IsInstanceFlipped |  Gets the value of the flip parameter on the adaptive instance.
MoveAdaptiveComponentInstance |  Moves Adaptive Component Instance by the specified transformation.
SetInstanceFlipped |  Sets the value of the flip parameter on the adaptive instance.
Top
See Also
Reference
Autodesk.Revit.DB Namespace